/**
 * Этот класс реализует задачу определения поверхности в точке шага робота.
 * Основная реализация ноды steps_controller находится здесь.
 *
 * Задачи:
 *  - По заданной координате шага и ряду других параметров, определять
 *    пригодна ли поверхность для осуществления шага
 *  - Поиск пригодной поверхности для шага в заданной окрестности
 *
 */

#ifndef AR600_VISION_STEPS_CONTROLLER_H
#define AR600_VISION_STEPS_CONTROLLER_H


class StepsController
{
    //Основные параметры
    //TODO: сделать возможность настройки параметров

};


#endif //AR600_VISION_STEPS_CONTROLLER_H
